---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarHookOrientation
source: html/e8365754-0811-8d4e-864a-55bf34af3a87.htm
---
# Autodesk.Revit.DB.Structure.RebarHookOrientation

Orientation of a rebar hook relative to the path of the Rebar Shape.

## Syntax (C#)
```csharp
public enum RebarHookOrientation
```